In [1]:
# 제2유형_연습하기_타이타닉	생존자	분류

In [2]:
# ✅데이터	분석	순서
# 1. 라이브러리	및	데이터	확인
# 2. 데이터	탐색(EDA)
#  3. 데이터	전처리	및	분리
# 4. 모델링	및	성능평가
# 5. 예측값	제출

In [3]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split

In [4]:
 ###############		복사	영역		###############
 #	실기	시험	데이터셋으로	셋팅하기	(수정금지)
 #	Seaborn의	내장	타이타닉	데이터셋을	불러옵니다.
 import	seaborn	as	sns
 df	=	sns.load_dataset('titanic')
 x	=	df.drop('survived',	axis=1)
 y	=	df['survived']
 #	실기	시험	데이터셋으로	셋팅하기	(수정금지)
 from	sklearn.model_selection	import	train_test_split
 x_train,	x_test,	y_train,	y_test	=	train_test_split(x,	y,	test_size=0.2,	stratify=y,random_state=2024)
 x_test	=	pd.DataFrame(x_test)
 x_train	=	pd.DataFrame(x_train)
 y_train	=	pd.DataFrame(y_train)
 y_test	=	pd.DataFrame(y_test)	#	평가용
 x_test.reset_index()
 y_train.columns	=	['target']	
 y_test.columns	=	['target']	
###############		복사	영역		###############
 ###	참고사항	###	
#	y_test	는	실기	문제상에	주어지지	않음
#	★Tip	:	X를	대문자로	쓰지말고	소문자	x로	쓰세요.	시험에서	실수하기	쉽습니다.(문제풀기	전에	소문자로	변경!)
 #	(참고	:	보통	X는	2차원	배열(행렬)이기	때문에	대문자로	쓰고,	y는	1차원	배열(벡터)이기	때문에	소문자로	씀)
 #	(~23년	10월말)	실기시험	데이터	형식	(실제	시험장에서는	다를	수	있으니	반드시	체크)	
#	X_test	=	pd.read_csv("data/X_test.csv")
 #	X_train	=	pd.read_csv("data/X_train.csv")
 #	y_train	=	pd.read_csv("data/y_train.csv")
 #	★(23년	10월말~)	기준으로	체험환경에서	제공되는	데이터셋이	조금	변경되었습니다.	
#	train	=	pd.read_csv("data/customer_train.csv")
 #	test	=	pd.read_csv("data/customer_test.csv")
 #	x_train과	y_train,	x_test를	별도로	할당해주셔야	합니다

In [5]:
# 타이타닉	생존자	예측	문제- 데이터의	결측치,	중복	변수값에	대해	처리하고- 분류모델을	사용하여	Accuracy,	F1	score,	AUC	값을	산출하시오.
# 데이터	설명
# survival	:	0	=	No,	1	=	Yes
#  pclass	:	객실	등급(1,2,3)
#  *모든 자료에 대한 권한은 메타코드에 있으며, 무단으로 자료를 복제 및 배포 등 유료목적으로 활용하시면 별도의 조치가 들어갈 수 있습니다.
# sex	:	성별
# age	:	나이
# sibsp	:	타이타닉호에	탑승한	형제/배우자의	수
# parch	:	타이타닉호에	탑승한	부모/자녀의	수
# fare	:	요금
# embarked	:	탑승지	이름(C,	Q,	S)	Cherbourg	/	Queenstown	/	Southampton
#  (중복)class	:	객실	등급(First,	Second,	Third)
#  who	:	man,	women,	child
#  adult_male	:	성인남자인지	여부(True=성인남자,	False	그외)
#  deck	:	선실번호	첫	알파벳(A,B,C,D,E,F,G)
#  (중복)	embark_town	:	탑승지	이름(Cherbourg,	Queenstown,	Southampton)
#  (중복)	alive	:	생존여부(no:사망,	yes:생존)
#  alone	:	혼자	탑승했는지	여부(True=혼자,	False=가족과	함께

In [6]:
x_train.head()

,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
313,3,male,28.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
736,3,female,48.0,1,3,34.3750,S,Third,woman,False,NaN,Southampton,no,False
165,3,male,9.0,0,2,20.5250,S,Third,child,False,NaN,Southampton,yes,False
7,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
114,3,female,17.0,0,0,14.4583,C,Third,woman,False,NaN,Cherbourg,no,True

In [7]:
y_train.head()

     target
313       0
736       0
165       1
7         0
114       0

In [8]:
x_test.head()

,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
517,3,male,NaN,0,0,24.1500,Q,Third,man,True,NaN,Queenstown,no,True
858,3,female,24.0,0,3,19.2583,C,Third,woman,False,NaN,Cherbourg,yes,False
10,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
306,1,female,NaN,0,0,110.8833,C,First,woman,False,NaN,Cherbourg,yes,True
340,2,male,2.0,1,1,26.0000,S,Second,child,False,F,Southampton,yes,False

In [9]:
print(x_train.shape)
print(y_train.shape)
print(x_test.shape)

(712, 14)
(712, 1)
(179, 14)

In [10]:
x_train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 712 entries, 313 to 205
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   pclass       712 non-null    int64
 1   sex          712 non-null    object
 2   age          566 non-null    float64
 3   sibsp        712 non-null    int64
 4   parch        712 non-null    int64
 5   fare         712 non-null    float64
 6   embarked     710 non-null    object
 7   class        712 non-null    category
 8   who          712 non-null    object
 9   adult_male   712 non-null    bool
 10  deck         165 non-null    category
 11  embark_town  710 non-null    object
 12  alive        712 non-null    object
 13  alone        712 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(3), object(5)
memory usage: 64.4+ KB

In [ ]:
y_train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 712 entries, 313 to 205
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   target  712 non-null    int64
dtypes: int64(1)
memory usage: 11.1 KB

In [ ]:
x_test.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 179 entries, 517 to 41
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   pclass       179 non-null    int64
 1   sex          179 non-null    object
 2   age          148 non-null    float64
 3   sibsp        179 non-null    int64
 4   parch        179 non-null    int64
 5   fare         179 non-null    float64
 6   embarked     179 non-null    object
 7   class        179 non-null    category
 8   who          179 non-null    object
 9   adult_male   179 non-null    bool
 10  deck         38 non-null     category
 11  embark_town  179 non-null    object
 12  alive        179 non-null    object
 13  alone        179 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(3), object(5)
memory usage: 16.6+ KB

In [13]:
# 결측치 처리

print(x_train.isnull().sum())

pclass           0
sex              0
age            146
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           547
embark_town      2
alive            0
alone            0
dtype: int64

In [14]:
print(x_test.isnull().sum())

pclass           0
sex              0
age             31
sibsp            0
parch            0
fare             0
embarked         0
class            0
who              0
adult_male       0
deck           141
embark_town      0
alive            0
alone            0
dtype: int64

In [15]:



x_train['age'] =  x_train['age'].fillna(35)
x_test['age'] = x_test['age'].fillna(35)

In [16]:
print(x_train.isnull().sum())

pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           547
embark_town      2
alive            0
alone            0
dtype: int64

In [17]:
print(x_test.isnull().sum())

pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
embarked         0
class            0
who              0
adult_male       0
deck           141
embark_town      0
alive            0
alone            0
dtype: int64

In [18]:
embarked_mode1 = x_train['embarked'].value_counts()
embarked_mode2 = x_test['embarked'].value_counts()

print(embarked_mode1,embarked_mode2)

S    513
C    135
Q     62
Name: embarked, dtype: int64 S    131
C     33
Q     15
Name: embarked, dtype: int64

In [19]:
x_train['embarked'] = x_train['embarked'].fillna('S')
x_test['embarked'] = x_test['embarked'].fillna('S')

In [20]:
deck_mode1 = x_train['deck'].value_counts()
deck_mode2 = x_test['deck'].value_counts()

deck_mode1,deck_mode2

(C    47
 B    40
 D    27
 E    25
 A    12
 F    11
 G     3
 Name: deck, dtype: int64,
 C    12
 B     7
 E     7
 D     6
 A     3
 F     2
 G     1
 Name: deck, dtype: int64)

In [21]:
x_train['deck'] = x_train['deck'].fillna('C')
x_test['deck'] = x_test['deck'].fillna('C')

In [22]:
print(x_train.isnull().sum())
print(x_test.isnull().sum())

pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    2
alive          0
alone          0
dtype: int64
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [23]:
# 변수처리 (의미가 중복되는 칼럼제거)

x_train = x_train.drop(['alive','embark_town','class'], axis=1)
x_test = x_test.drop(['alive', 'embark_town','class'], axis=1)

In [24]:
x_train['familysize'] = x_train['sibsp'] + x_train['parch'] + x_train['alone']
x_test['familysize'] = x_test['sibsp'] + x_test['parch'] + x_test['alone']

x_train['alone'] = x_train['alone'].replace({True:1,False:0})
x_test['alone'] = x_test['alone'].replace({True:1,False:0})

x_train['adult_male'] = x_train['adult_male'].replace({True:1,False:0})
x_test['adult_male'] = x_test['adult_male'].replace({True:1,False:0})

In [25]:
x_train = x_train.drop(columns=['sibsp','parch','alone'])
x_test = x_test.drop(columns=['sibsp','parch','alone'])

In [26]:
x_train.head()

,pclass,sex,age,fare,embarked,who,adult_male,deck,familysize
313,3,male,28.0,7.8958,S,man,1,C,1
736,3,female,48.0,34.3750,S,woman,0,C,4
165,3,male,9.0,20.5250,S,child,0,C,2
7,3,male,2.0,21.0750,S,child,0,C,4
114,3,female,17.0,14.4583,C,woman,0,C,1

In [27]:
x_train['sex'] =  x_train['sex'].replace({'male':0, 'female':1})
x_test['sex'] =  x_test['sex'].replace({'male':0, 'female':1})


x_train['fare'] = round(x_train['fare'])
x_test['fare'] = round(x_test['fare'])

In [28]:
x_train.head()

     pclass  sex   age  fare embarked    who  adult_male deck  familysize
313       3    0  28.0   8.0        S    man           1    C           1
736       3    1  48.0  34.0        S  woman           0    C           4
165       3    0   9.0  21.0        S  child           0    C           2
7         3    0   2.0  21.0        S  child           0    C           4
114       3    1  17.0  14.0        C  woman           0    C           1

In [29]:
x_train['who'].unique()

array(['man', 'woman', 'child'], dtype=object)

In [30]:
child = x_train[x_train['who']=='child']
child = x_test[x_test['who']=='child']
adult = x_train[x_train['who']!='child']
adult = x_test[x_test['who']!='child']
x_train['child'] = x_train['who'].copy()
x_test['child'] = x_test['who'].copy()

In [31]:
x_train['child'] = np.where(x_train['child']=='child',1,0)
x_test['child'] = np.where(x_test['child']=='child',1,0)

In [32]:
x_train = x_train.drop('who',axis=1)
x_test = x_test.drop('who',axis=1)

In [33]:
x_train.head()

     pclass  sex   age  fare embarked  adult_male deck  familysize  child
313       3    0  28.0   8.0        S           1    C           1      0
736       3    1  48.0  34.0        S           0    C           4      0
165       3    0   9.0  21.0        S           0    C           2      1
7         3    0   2.0  21.0        S           0    C           4      1
114       3    1  17.0  14.0        C           0    C           1      0

In [34]:
x_test.head()

     pclass  sex   age   fare embarked  adult_male deck  familysize  child
517       3    0  35.0   24.0        Q           1    C           1      0
858       3    1  24.0   19.0        C           0    C           3      0
10        3    1   4.0   17.0        S           0    G           2      1
306       1    1  35.0  111.0        C           0    C           1      0
340       2    0   2.0   26.0        S           0    F           2      1

In [35]:
from sklearn.preprocessing import LabelEncoder

le = LabelEncoder()

x_train['embarked'] = le.fit_transform(x_train['embarked'])
x_test['embarked'] = le.transform(x_test['embarked'])

x_train['deck'] = le.fit_transform(x_train['deck'])
x_test['deck'] = le.fit_transform(x_test['deck'])

In [36]:
print(x_train.info())
print(x_test.info())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 712 entries, 313 to 205
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   pclass      712 non-null    int64
 1   sex         712 non-null    int64
 2   age         712 non-null    float64
 3   fare        712 non-null    float64
 4   embarked    712 non-null    int32
 5   adult_male  712 non-null    int64
 6   deck        712 non-null    int32
 7   familysize  712 non-null    int64
 8   child       712 non-null    int32
dtypes: float64(2), int32(3), int64(4)
memory usage: 47.3 KB
None
<class 'pandas.core.frame.DataFrame'>
Int64Index: 179 entries, 517 to 41
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   pclass      179 non-null    int64
 1   sex         179 non-null    int64
 2   age         179 non-null    float64
 3   fare        179 non-null    float64
 4   embarked    179 non-null    int32
 5   adult_male  179 non-null    int64
 6   deck        179 non-null    int32
 7   familysize  179 non-null    int64
 8   child       179 non-null    int32
dtypes: float64(2), int32(3), int64(4)
memory usage: 11.9 KB
None

In [37]:
print(x_train.head())
print(x_test.head())

     pclass  sex   age  fare  embarked  adult_male  deck  familysize  child
313       3    0  28.0   8.0         2           1     2           1      0
736       3    1  48.0  34.0         2           0     2           4      0
165       3    0   9.0  21.0         2           0     2           2      1
7         3    0   2.0  21.0         2           0     2           4      1
114       3    1  17.0  14.0         0           0     2           1      0
     pclass  sex   age   fare  embarked  adult_male  deck  familysize  child
517       3    0  35.0   24.0         1           1     2           1      0
858       3    1  24.0   19.0         0           0     2           3      0
10        3    1   4.0   17.0         2           0     6           2      1
306       1    1  35.0  111.0         0           0     2           1      0
340       2    0   2.0   26.0         2           0     5           2      1

In [ ]:
from sklearn.model_selection import train_test_split

x_train, x_val, y_train, y_val = train_test_split(x_train, y_train, 
                                                  test_size=0.2,
                                                  stratify=y_train,
                                                  random_state=2024)

In [39]:
print(x_train.shape)
print(x_val.shape)
print(y_train.shape)
print(y_val.shape)

(569, 9)
(143, 9)
(569, 1)
(143, 1)

In [40]:
from sklearn.ensemble import RandomForestClassifier

rfc = RandomForestClassifier(random_state=2024)
rfc_model = rfc.fit(x_train,y_train)
pred = rfc_model.predict(x_val) 

from sklearn.metrics import accuracy_score, confusion_matrix, classification_report

acc = accuracy_score(y_val,pred)
conf_matrix = confusion_matrix(y_val, pred)

c:\Users\jooon\anaconda3\Lib\site-packages\sklearn\base.py:1151: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  return fit_method(estimator, *args, **kwargs)

In [41]:
report = classification_report (y_val, pred)

In [42]:
print('acc:', acc)
print('conf_matrix:', conf_matrix)
print('report:', report)

acc: 0.8181818181818182
conf_matrix: [[78 10]
 [16 39]]
report:               precision    recall  f1-score   support

           0       0.83      0.89      0.86        88
           1       0.80      0.71      0.75        55

    accuracy                           0.82       143
   macro avg       0.81      0.80      0.80       143
weighted avg       0.82      0.82      0.82       143

In [43]:
pred2 = rfc_model.predict(x_test)

acc2 = accuracy_score(y_test, pred2)
conf_matrix2 = confusion_matrix(y_test,pred2)
report2 = classification_report(y_test, pred2)

In [44]:
print('acc2:', acc2)
print('conf_matrix2:', conf_matrix2)
print('repor2t:', report2)

acc2: 0.8100558659217877
conf_matrix2: [[95 15]
 [19 50]]
repor2t:               precision    recall  f1-score   support

           0       0.83      0.86      0.85       110
           1       0.77      0.72      0.75        69

    accuracy                           0.81       179
   macro avg       0.80      0.79      0.80       179
weighted avg       0.81      0.81      0.81       179